In [6]:

import numpy as np
np1=np.arange(25).reshape(5,5)
np1

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

dataframe from numpy array

In [7]:
import pandas as pd
df1=pd.DataFrame(np1,index=['r1','r2','r3','r4','r5'],columns=['c1','c2','c3','c4','c5'])
df1

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19
r5  20  21  22  23  24

dataframe from list of list

In [8]:
l1=[[1,2,3],[44,55,66],[77,88,99]]
df2=pd.DataFrame(l1,columns=['tsla','amzn','goog'],index=[11,12,13])
df2

    tsla  amzn  goog
11     1     2     3
12    44    55    66
13    77    88    99

dataframe from dict of list

In [9]:
dl1=[{"name":'tsla','price':500,'sector':'auto'},
     {"name":'amzn','price':600,'sector':'tech'},
     {"name":'jpmorgan','price':800,'sector':'bank'}]
df3=pd.DataFrame(dl1)
df3

       name  price sector
0      tsla    500   auto
1      amzn    600   tech
2  jpmorgan    800   bank

list of dictionary

In [10]:
ld1={"name":['tsla','amzn','jpmorgan'],
     'price':[500,600,800],
     'sector':['auto','tech','bank']}
df4=pd.DataFrame(ld1)
df4

       name  price sector
0      tsla    500   auto
1      amzn    600   tech
2  jpmorgan    800   bank

csv

In [11]:
df5=pd.read_csv('sp500.csv')
df5

                           Name                  Sector   Price    EPS
0                     Apple Inc  Information Technology  170.12   9.20
1                    Abbvie Inc             Health Care   93.29   5.31
2           Abbott Laboratories             Health Care   55.28   2.41
3                 Accenture Plc  Information Technology  145.30    NaN
4                  Allergan Plc             Health Care  171.81  15.42
..                          ...                     ...     ...    ...
97   Verizon Communications Inc      Telecommunications   45.85   3.75
98     Walgreens Boots Alliance        Consumer Staples   70.25   5.10
99        Wells Fargo & Company              Financials   54.02   4.14
100             Wal-Mart Stores        Consumer Staples   96.08   4.36
101            Exxon Mobil Corp                  Energy   80.31   3.56

[102 rows x 4 columns]